{"true_label": "negative", "pred_label": "netural", "text": "No adding option for the time"}
{"true_label": "positive", "pred_label": "netural", "text": "Love the design of app. Please provide export options. (Reason for not giving 5 ⭐)"}
{"true_label": "negative", "pred_label": "netural", "text": "Great app, but it just syncs to my google calendar making it redundant. I wanted to use this for nonpersonal task and keep it separated. While using the App I get 40 notifications because it updates my personal calendar as well. I gave 2 stars because otherwise the functionality and UI is really nice."}
{"true_label": "positive", "pred_label": "netural", "text": "Made outlook play nicely by just importing my outlook calendars to google calendar. so that was pretty easy really.  I love the widget on my phone, it looks good, works nicely, it's awesome. The phone-clockface however can't be configured I can't find any option to add my business-calendar and some shared calendars to the clock face, it seems to only show my primary calendar (which apart from my own birthday is completely emtpy). (I'm aware that on Android one can select calendars, they just don't reflect over to the android watchface)"}
{"true_label": "positive", "pred_label": "netural", "text": "Would be 5 stars for sure except I can't add a task to the top of the list. It is infuriating for something that would be such a minor dev lift. And they do know about the idea per the forums. Love everything else."}
{"true_label": "positive", "pred_label": "netural", "text": "I need help from dev. One of my favorite apps of all time combines scheduling and rpg gaming in one not 5 stars because I bought premium but when I logged into my kindle premium status didnt show up neither did my other data from my phone please help devs!"}
{"true_label": "negative", "pred_label": "netural", "text": "The app is okay, but the reminders in SUPPOSED to get only happen SOME of the time. Really annoying."}
{"true_label": "netural", "pred_label": "negative", "text": "I used to be a big fan of any.do products and I used any.do, any.cal for years, I think these apps are really easy to use. However, when I set a reminder for an appointment every Monday, it only allows me to set reminders on every Thursday( the date that I created that reminder) instead of Monday. it's really disappointing."}
{"true_label": "positive", "pred_label": "netural", "text": "Excellent features but needs more exciting UI Edit: wow cool dev for replying. I'd like to add that I feel like the difficulty-urgency-fear system is holding the app back. Habitica uses a basic trivial, easy, medium, hard system for setting XP, which makes it quicker to just jot a task down, and I think DoItNow would defo benefit from that."}
{"true_label": "netural", "pred_label": "negative", "text": "This app seems to work for some people but honestly the only incentive for not touching your phone for some period is to have an image of a tree grow. It ignores the fact that most \"useless\" screen time is due to staying on you phone once you have unlocked it, but simply answering a message here and there from time to time is just a good use of a smartphone."}
{"true_label": "netural", "pred_label": "positive", "text": "Can you fix the bug where when adding a task, the keyboard fills up past the options that lets you select priority and projects? It's not critical but it's annoying to see at a UX level"}
{"true_label": "negative", "pred_label": "positive", "text": "Reminder is under premium! Seriously! Must need unstall"}
{"true_label": "positive", "pred_label": "netural", "text": "Good app. Unfortunately the widget keeps going empty, it Refills once the app is opened, but this happens despite battery optimisation being turned off."}
{"true_label": "negative", "pred_label": "netural", "text": "برنامه ی خیلی خوبیه. از همشون بهتره.ولی جا داره ک بهترم بشه"}
{"true_label": "positive", "pred_label": "netural", "text": "I really like the app. I'm having an issue though where the widget doesn't populate when a new day starts. I have to delete it and readd it or restart my phone."}
{"true_label": "negative", "pred_label": "netural", "text": "I understand the implementing of a pro version, I understand giving it perks. What I don't understand is taking away previously unlocked trees (that were so much fun & rewarding to unlock). Those felt earned, you could have made those trees Pro-limited from here on out, without having to take them away from those who earned them already. That felt like a loss, & a betrayal... in less dramatic terms : it was rather upsetting 😕"}
{"true_label": "netural", "pred_label": "negative", "text": "Confusion regarding 'sharing' your schedule with other team members or subscibers. Seriously, would it kill them to put an 'added', 'enter', or some kind of 'task completed' button... it would save a lot of confusion. Sending an invite to fellow workers results in a vague link that seems disconnected with the original intention. No 'Connect with Users' or anything other than a link. For something that's supposed to be time management related, I've wasted hours trying to figure this out."}
{"true_label": "netural", "pred_label": "negative", "text": "Just as I was about to rate this 5 stars, it only let me have 16 \"subtasks\" It's stupid. Let us have more \"subtasks\" and I'll give you guys 5 stars."}
{"true_label": "negative", "pred_label": "netural", "text": "Can you please disable the notification asking me what I want to do today? I don't want to see it, but there's no way to disable."}
{"true_label": "netural", "pred_label": "positive", "text": "Great app"}
{"true_label": "positive", "pred_label": "negative", "text": "For power to do listers only. Rediscovered this app when I got a new role that had complex organization needs. Now nothing slips through the cracks, plus I never feel overwhelmed despite how robust the app is and how many tasks it can manage."}
{"true_label": "netural", "pred_label": "positive", "text": "User friendly and very effective!💚💯👍"}
{"true_label": "negative", "pred_label": "netural", "text": "Too much ads"}
{"true_label": "netural", "pred_label": "negative", "text": "It could have been a robust app but these bunch of loosers want you to pay every month is annoying."}
{"true_label": "positive", "pred_label": "netural", "text": "The one major short-coming of this app. (and most other \"habit trackers\") is that it does not have any option to calculate a total number (amount of hours, etc.) for a week or month--only a number of days or per day...That is a gaping deficit in these app's (with the exception of one or two with less desirable formats), as it is a far better way to track things like sleep which may fluctuate from.day to day. The other dismaying factor is that Habitbull doesn't seem to have any customer service, as I e-mailed numerous times about issues trying to upgrade (because it is a really helpful/useful application), and never got any response in about a year's time. :-\\ Aside from the tabulation inadequacy discussed above--which I really hope they'll address/include that capability, it is a really helpful and useful app., and can be especially helpful for people with issues such as depression or \"OCD\" who may have difficulty keeping a handle on self-care and/or productivity (though, it could, also have the opposite effect, if people with \"OCD\" get too immersed in tracking things in their day-to-day :-S). In general, it is a good tool to have, though, and can help you make a lot of progress on things like household projects, etc., but I really do wish that they'd adjust it so that you can calculate a total for a duration of time longer than a day, and that they would also be conscientious about customer service/support and responding to/fielding correspondence and issues people encounter. ~*Kristin Star*"}
{"true_label": "negative", "pred_label": "netural", "text": "Is the app or web platform down today? Can't seem to login either."}
{"true_label": "netural", "pred_label": "negative", "text": "Event notifications don't sound."}
{"true_label": "positive", "pred_label": "netural", "text": "This app is literally the only thing that reminds me to take my meds. I love getting the notifications and tracking my progress so easily. However I just upgraded to the pro version specifically for the sync capability and...it does not work. -1 star. For $10, I would hope that the one feature I wanted would function like it's supposed to. I'm not happy about that at all. The home screen widget comes in handy so it's not a total loss but that alone is not worth the price. Please fix syncing!"}
{"true_label": "positive", "pred_label": "netural", "text": "I love the concept. This is something I've been looking for a long time. I have installed Sectograph; however, I haven't been able to make it work using sync with Outlook. I use Exchange as corporate email and this app is really practical and useful for my work. I have tried sync my calendar with google but I haven't been able to do it in the right, fully automated manner. I was able to sync with Outlook however even when the app is connected and without any issue the events does not show. I have tried what you explain in your FAQs without success. I'm a little bit frustrated since I'd love to use it but it seems impossible. I'll really appreciate any hint/help you can provide me. The 5 stars is for the overall concept, since I haven't been able to use it yet."}
{"true_label": "netural", "pred_label": "positive", "text": "the simple layout makes navigation easy and intuitive. I decided to try this as an alternative to Google calendar and whislt its integration of AI assistants and task tracking seems very good, as a calendar I have to say im not impressed. Looking at the calendar from a months perspective doesnt show at a glance which days you have something happening, rather, below the calendar is a schedule view which shows you what events you have which i find confusing. Would be nice to view by month."}
{"true_label": "netural", "pred_label": "negative", "text": "Its okay"}
{"true_label": "netural", "pred_label": "negative", "text": "Delet"}
{"true_label": "negative", "pred_label": "netural", "text": "Heres the thing. I love this app and the idea behind it. But for some reason its so dang glitchy. Pages wont always change when i scroll. Tasks dont refresh. I often have to completely close the app. Help! Very willing to change this review to 5 stars if we get this figured out."}
{"true_label": "positive", "pred_label": "netural", "text": "i really liked the app but i have a problem as somtimes i I finish my work before the timer is off so i either have to wait for it to end or loose my tree which is kinda unfair. so itd be really good if u guys added like a finish work opsion or maybe a check list where the time stops when ur done w all ur tasks. thank you."}
{"true_label": "negative", "pred_label": "netural", "text": "I was testing this to replace Fabulous. So far the notifications are not persistent enough. Fabulous is able to wake me up in the morning."}
{"true_label": "netural", "pred_label": "negative", "text": "It won't notify me"}
{"true_label": "netural", "pred_label": "negative", "text": "Slow responding in manipulating events and tasks"}
{"true_label": "netural", "pred_label": "positive", "text": "Quite good. It would be better if the lists were all ordered alfabetically and warned on duplicated entries. Some times it gets back to previous items even thoug Ideleted them."}
{"true_label": "negative", "pred_label": "netural", "text": "I love this app but after few update it automatically close and my tree got withered. I have already allowed to run in background. Still forest shut down and my trees withered. Fix this bug! It really worth pro version but after this problem i found useless pro version because my trees got withered as well as it doesnt stop to run other apps l.😤😏😏. Fix it"}
{"true_label": "netural", "pred_label": "negative", "text": "I found this app difficult to use. That's just my personal opinion. I uninstalled it and got a different one that is easier to use."}
{"true_label": "negative", "pred_label": "netural", "text": "This has always worked well, but since a few days every morning it has a notification which says \"You completed 0 of 1 last time.\" This malformed English text is a bug, as I have disabled notifications from the app in it's settings."}
{"true_label": "negative", "pred_label": "netural", "text": "Free account limited to 5 habits"}
{"true_label": "negative", "pred_label": "netural", "text": "This use to be a great app but now they prioritise to make money. An advise: if you want to make more money don't change what you offer to your already users/members that support your app for years, make new products and tools (within the app) that worth spending money on"}
{"true_label": "positive", "pred_label": "netural", "text": "It's so far okay"}
{"true_label": "positive", "pred_label": "netural", "text": "Great to do list but where's the google assistant support?"}
{"true_label": "negative", "pred_label": "netural", "text": "Forest is a great app and it used to work perfectly for me, helping me focus and do what it says but after reinstalling the app I am unable to login into the account in which I had purchased premium, and it shows an error that reads- an error occurred while restoring the purchase and to logout out of other account, which I did to no avail, I even emailed twice since 3 days and I haven't got a reply yet and the issue remains till date.I am very disappointed by this"}
{"true_label": "negative", "pred_label": "positive", "text": "Very very 👎👎😠😠"}
{"true_label": "positive", "pred_label": "netural", "text": "I like it, but I wish I could go to the days ahead and see everything planned instead of what is just at or ahead of the time right now. For example, it is 5pm right now, and I can only see what's happening after 5pm tomorrow."}
{"true_label": "netural", "pred_label": "negative", "text": "I have been using this app for years, and have loved it, but the latest version is sucking my battery. It's very frustrating."}
{"true_label": "negative", "pred_label": "netural", "text": "I liked this app and used all the time. But popping up ads are now annoying me so much... I'm considering an alt calendar app"}
{"true_label": "negative", "pred_label": "netural", "text": "i cant set my times for events bc theres no am/pm option. it keeps changing my time not allowing me to put the right thing..annoying"}
{"true_label": "positive", "pred_label": "netural", "text": "Nice apps. But need to re download the full version."}
{"true_label": "negative", "pred_label": "netural", "text": "The interface is incredible! It's the perfect organizational app I've always been looking for. This is all overshadowed for me however by the fact that it is automatically attached to your email with no way to remove it. I would use this app daily if it would just exist in it's own bubble without needing to grab onto 3+ emails. Minor complaint but it really turned me off from the app, and if I had known this I would not have used it in the first place."}
{"true_label": "negative", "pred_label": "positive", "text": "There is a big banner of a cat and a dog with sime motivational lines on the home page. Also, i can't set up reminder every 2 days although i can set up a habit every two days."}
{"true_label": "positive", "pred_label": "netural", "text": "Super program"}
{"true_label": "netural", "pred_label": "negative", "text": "True a unsnecessarypts at r"}
{"true_label": "netural", "pred_label": "positive", "text": "Nice app"}
{"true_label": "netural", "pred_label": "negative", "text": "Used to work really well, now the notifications wont work on my xiaomi phone, rendering ot pretty much useless..and I tried everything"}
{"true_label": "negative", "pred_label": "netural", "text": "I paid for the premium so I can get things repeated weekly. I tried to put something in to be repeated every week on Tuesday. It only repeated one week thats it. So I have to put it in manually for every tue. There should be a way to type in once and then set a repeat so it will auto show every Tuesday. I feel like I wasted my money now. I set repeat to every 7 days it does not work."}
{"true_label": "negative", "pred_label": "netural", "text": "The reminder to 'plan your day' keeps resetting to 'on'. I regularly turn it off but it resets to on with a default time of 9am. I don't need reminded to plan my day!"}
{"true_label": "netural", "pred_label": "positive", "text": "I like the app so far. One issue is like someone else said, why do you have to pay for the app before doing a free 14-day trial? Second, why don't the notifications pop up where I can see them? That was one of the main reasons that I got the app. I need to be constantly reminded of what I need to do. I have ADHD and remembering a bunch of things that I have to do is a HUGE issue."}
{"true_label": "negative", "pred_label": "netural", "text": "it shows you all the features, very helpful and everything and as a final blow... it will tell you that 24 hour widget is only available via in app purchase. This is very very misleading for someone who have given their time, signed in with google, synced their events etc. frustrated."}
{"true_label": "negative", "pred_label": "netural", "text": "Hard to use"}
{"true_label": "netural", "pred_label": "negative", "text": "Meh =^="}
{"true_label": "positive", "pred_label": "netural", "text": "Still using this app a year later. I love the new habit feature. However, the notifications do not work, I never receive any notifications despite giving all the permissions so I often miss my tasks if I don't open and check the app manually."}
{"true_label": "positive", "pred_label": "netural", "text": "It's not really good for online studing but that's alright"}
{"true_label": "netural", "pred_label": "positive", "text": "User friendly and very effective!💚💯👍"}
{"true_label": "positive", "pred_label": "negative", "text": "Купил подписку и пока жалею. Отвратительная синхронизация, вче что набивается на десктопе, показывается на телефоне лишь раз, потом данные очищаются и при попытке перелогиниться приложение зависает, после чего приходится его полностью переустанавливать."}
{"true_label": "netural", "pred_label": "negative", "text": "I don't know why this app is an \"Editor's choice\" there isn't any special graphics and you need to be a premium to change a color. Keep Google give me all this for free! I was just looking for a different to-do list where I could change the size of the letters."}
{"true_label": "negative", "pred_label": "netural", "text": "انه فاشل، كله مدفوع"}
{"true_label": "positive", "pred_label": "netural", "text": "Actually not bad, quite good. If you want to find a app WITHOUT ANY PURCHASE AND ADS, you have find the correct one. I didn't rate for 5 stars because of two reasons. First, it is a LITTLE difficult for me to use makes me a little complicated at first. But now is okay, I know how to use it already. Second, the choices of the theme is quite less. User can choose solid colour or pictures THAT PROVIDED ONLY. And I hope the app will add more nice choices for the theme."}
{"true_label": "positive", "pred_label": "netural", "text": "This is a very unique and interesting game, and it's really been helping me keep schedule during quarantine, which is amazing and really makes me happy, but it only gets four stars because sometimes it doesn't keep content. I used a royal purple hatching potion on one of my tiger eggs (I had two) and both items disappeared from my inventory but I didn't get my tiger, which is really disheartening. Very willing to fix this review if it suddenly shows up, but I don't think it will :[edit-fixed!!"}
{"true_label": "negative", "pred_label": "netural", "text": "Revised review: Sometimes we seek out apps to help with deficiencies or make life work out. App was so great and so functional for months, until a few days ago. I was working around the changed, now cumbersome, reschedule/edit/rename tasks process. But Labels beyond a few characters are hidden now. Todoist Labels was The Thing for this app for me, with efficiently visually seeing/grouping tasks. Had made app ahead of many others. App needs more display settings then...to be usable again."}
{"true_label": "negative", "pred_label": "netural", "text": "this app would be 100x better if it incorporated some of the editting/customizing functions of the other to-do-list apps out there. i want to be able to strike through each of the to do items and view deleted/archived/completed items. be able to choose colors etc .."}
{"true_label": "positive", "pred_label": "netural", "text": "good. yes. me like"}
{"true_label": "netural", "pred_label": "negative", "text": "Widget non responsive.. suddenly u want to tick one item. A whole lot of other items tht got clicked"}
{"true_label": "netural", "pred_label": "positive", "text": "Ok"}
{"true_label": "positive", "pred_label": "netural", "text": "I always 5 star everything, no wories there, however since this last update, when I click on a join forest link, it will open the Forest app, but not join the room. Links from discord to join a room is no longer working for me. :( i have already reinstalled the forest and the discord apps, and also tryed reset app preferences. Neither made a difference."}
{"true_label": "netural", "pred_label": "negative", "text": "Everything is okay but it doesn't notify on time. I missed an important event because of this bug. I've used other apps on Play Store and all of them have the same problem. Some of them don't notify when the screen is locked. None of them are perfect. At times the app notifies me only after I open it."}
{"true_label": "netural", "pred_label": "positive", "text": "easy to use"}
{"true_label": "netural", "pred_label": "negative", "text": "You need to make a clear all data or reset everything button. I had to delete my account because it triple synced and I wanted all this mess gone and I couldn't. Please consider it."}
{"true_label": "negative", "pred_label": "netural", "text": "Dumbest app :("}
{"true_label": "netural", "pred_label": "positive", "text": "It would be awesome if it allows to add your own wallpaper"}
{"true_label": "negative", "pred_label": "netural", "text": "I find the app inflexible and buggy, with a counter intuitive UI. How to delete or rename tags was not obvious. Using the back button would often exit the app at unusual times. After adding a new tag the app wouldn't allow me to do anything until I exited and restarted. Plus, the premium features seem more like essential features, to me. Looking for an alternative app as we speak."}
{"true_label": "positive", "pred_label": "negative", "text": "NLP stuff is great👍"}
{"true_label": "positive", "pred_label": "netural", "text": "This app is very customizable, which I definitely wanted in an RPG style To Do list. However, it does come at a cost, since getting everything set up how you'd like takes much longer than similar apps. Personally I think the trade is worth it (hence my rating), but be aware that if you're looking for something more simple, this probably isnt the app for you. If you want to really determine exactly how you want things to work, pick this one over the others!"}
{"true_label": "positive", "pred_label": "negative", "text": "Not very easy to navigate the settings"}
{"true_label": "positive", "pred_label": "netural", "text": "I like the way it occasionally pops up to remind you"}
{"true_label": "netural", "pred_label": "positive", "text": "Hodtf coder jbikhkhkm kvukb"}
{"true_label": "negative", "pred_label": "netural", "text": "Slows down my phone big time"}
{"true_label": "negative", "pred_label": "netural", "text": "The app itself is great. I used it quite regularly a few years back but when I tried to use it again it seems that the 'new' owners don't acknowledge their 'lifetime' subscription. Sure hope my emails get more results besides ... /ignore kthnxbye Sent an email ... they said they opened a ticket and then ... crickets. Nice .. thanks, downgraded to"}
{"true_label": "negative", "pred_label": "netural", "text": "Pls give us dark theme cost-free so my eyes won't die using this app"}
{"true_label": "netural", "pred_label": "negative", "text": "The feature of customization for repeating calendar/event function has disappeared. When attempting to modify, it used to asked, \"Do you want to delete all calendar/event in the series or delete this particular function?\" Except for grandfathered calendar functions, the feature of attempting to delete a particular calendar function/event no longer exists."}
{"true_label": "negative", "pred_label": "netural", "text": "Due Date is wonky. I made a few items on my list and the due will not change from the current day. The due date worked on other items. I don't need another app to work around."}
{"true_label": "negative", "pred_label": "netural", "text": "i cant set my times for events bc theres no am/pm option. it keeps changing my time not allowing me to put the right thing..annoying"}
{"true_label": "netural", "pred_label": "negative", "text": "the app itself is a wonderful idea, but the interface and functions need a lot of work in my opinion. it took me so long to figure out how to set up a habit, and i still don't understand how to use a task groups or steps. I gave up and came back to my previous tracker because it was too complicated and time consuming to learn how to use this one. Anyway, I will definitely retry after an update :)"}
{"true_label": "netural", "pred_label": "negative", "text": "I found this app difficult to use. That's just my personal opinion. I uninstalled it and got a different one that is easier to use."}
{"true_label": "netural", "pred_label": "positive", "text": "Nice app"}
{"true_label": "netural", "pred_label": "positive", "text": "Всё отлично, но не работает таймер Помодоро:("}
{"true_label": "negative", "pred_label": "netural", "text": "Update: thanks for your response. I would ask the developers to check their own app. There is NO monthly subscription option in the app. Old review: No monthly subscriptions? Why should I be forced to subscribe for a year? I am definitely not subscribing for a year in one go. This is ridiculously desperate."}
{"true_label": "netural", "pred_label": "negative", "text": "It was great but when my phone was reset and I installed again the app, I cannot login even after purchasing the Pro version. It sucks having to purchase again."}
{"true_label": "negative", "pred_label": "positive", "text": "Paid widget feature!!!!! One thing that downplays all other."}
{"true_label": "negative", "pred_label": "netural", "text": "You asked me to pay premium version but instant Google calendar sync still doesn't work, needs few hours for tasks to sync. This been an issue for years already and you ignore pleas from users. On the other hand the Gtasks app you have works really great."}
{"true_label": "netural", "pred_label": "positive", "text": "I love lists, and I really love this easy to use app, however I also love making notes to myself of a *lengthy* nature (usually when I'm trying to go to sleep), like my thoughts on a subject or what Id like to talk about to a friend, it would be amazing if there was a blank note page or lined page without all the Frills of *dates and times and priority and complete* to compete with my eyes. I dislike having to have multiple apps for same basic function. I'd chose this over all others. 👍"}
{"true_label": "netural", "pred_label": "negative", "text": "Overall, I like the app. However, I'm uninstalling because of the pop-up notification that goes over other apps and basically freezes my phone until i dismiss it. The app doesn't have permission to draw over other apps and no way to disable this notification. The only reason it isn't 1 star is because overall the app is good.. they just ruin it with that 'feature'."}
{"true_label": "netural", "pred_label": "positive", "text": "It's a great app and has definitely helped me maintain my habits. I had been gifted premium early on, but I've found that the features have disappeared and I'm only seeing the base version. I like it enough that I want to buy it, but I worry about whether it will keep the features based on my experience and other reviews. I've also found a bug: when I have a goal set to 3x a week as \"success,\" the app doesn't recognize when I've had a successful streak and always shows as 0 successes in the streak section, whereas it's at 80% in the \"percent success\" section and many weeks of meeting my goal."}
{"true_label": "negative", "pred_label": "netural", "text": "I loved this app, but until they get rid of the yearly charge after making us buy it to begin with I'll keep this at a 1. I did previously have this as 5 star, but I can't stand companies doing stuff like this."}
{"true_label": "positive", "pred_label": "negative", "text": "Had written a bad review because I spent a week trying to make the app show two widgets with different calendars. Couldn't do it (and wasted hours!) until I noticed a nearly invisible dot (at least on my screen, I'm using the iblue app) near the widgets. Pressed it and discovered the widget menu! They should really make it stick out or write clear instructions about it on the app. I imagine they try to make it subtle in order to not affect how the app looks, but it took a week to find it."}
{"true_label": "negative", "pred_label": "netural", "text": "Reduced the rating for fun because of this \"earn a mistery color theme\" trolling in the latest update. I expected black and got disappointed. So bring me the true black theme (not \"dark\") to \"earn\" a proper rating from this subscriber. :) Actual review: I love the \"what's new\" details for every new update. I feel like I know what I am paying for with my subscription. Support is also good. Only feature missing is calendar view/integration."}
{"true_label": "netural", "pred_label": "negative", "text": "I've been using BC1 for years and I've installed BC2 on at least 2 seperate occasions. BC2 is so not as good as BC1. The overall look makes it look like a cheap childs game. The functionality became nonsensical and it made going back to BC1 such a pleasure. I can't imagine what the developers were thinking when making such changes. After using BC1 for so long I had high hopes for its future development but alas it not to be. These days I'm looking elsewhere."}
{"true_label": "negative", "pred_label": "netural", "text": "Great Concept but executed poorly. I added 2 events between 6.30am and 9.30 but when I tried adding one for 10.30am it would let me, saying it overlapped with another event which it did not. I even checked my calendar and nothing was there for that time. It's now 11.42am, I tried adding an event for 3.30pm and it said its saved but hasn't showed on the clock or anything so it's pretty useless at this point."}
{"true_label": "netural", "pred_label": "positive", "text": "Really unique app that motivates me to get stuff done. Unfortunately, this app needs A LOT of work. I tried writing a message in a guild chat. Once it got long enough, the words disappeared behind my keyboard so I couldn't see what I was writing. When I put the keyboard down, the send button disappeared..as a result I couldn't send my message. Theres no search for trying to find a challenge that suits you. Theres no notifications when your party is chatting. There is also no search for guilds. I just started this app and so for these are the problems I've noticed. Otherwise it is great and I hope it improves."}
{"true_label": "negative", "pred_label": "netural", "text": "too many ads and require to pay for applications that are commonly found in play store."}
{"true_label": "netural", "pred_label": "negative", "text": "This apps not suitable for my needs. The reminder keep show every day, even the task mark as 'Done' (everyday I do click 'Done' at reminder, the next day, and next day, and next day, the reminder still come up). The logic for the apps does not make sense for me (I'm not a paid subscribber)."}
{"true_label": "negative", "pred_label": "netural", "text": "I don't like the layout at all. I want it to be much more simple and quick to edit my daily tasks."}
{"true_label": "negative", "pred_label": "positive", "text": "I like how the app has options to write notes/journals for each day. It gives you the option to reflect on how you stuck to your habits. Most other apps don't have this feature. That said, I'm rating the app two stars because the notifications don't work for me. I have set times for reminders throughout the day, but the app sends me random notifications (reminders) when I don't want them. And on other days, no notifications at all. No app updates from the developer in over a year either."}
{"true_label": "positive", "pred_label": "netural", "text": "Hello dev.. I've been a user for about 4-5 months now.. And I mean to say as positive criticism that the UI kinda sucks man.. It looks way worse than the previous versions.."}
{"true_label": "positive", "pred_label": "netural", "text": "why my forest application doesn't sound loud enough so I know for sure when the timer stops, please help this problem because I really like forest applications"}
{"true_label": "negative", "pred_label": "netural", "text": "Why can I not select calendar anymore when making smart lists?"}
{"true_label": "negative", "pred_label": "positive", "text": "I came back to this app a go three times over the last 2 years because I really wanted it to work. Each time I tried, I spent a couple of hours trying to navigate around the features and failed to get anything out of it. Incredibly unintuitive, no in app explanation, and the online \"getting started page\" doesn't explain much on what each features do. Edit: Thank you developer for the reply, it shows that you care. I wish you all the best in making the improvements, the idea behind the app is honestly good."}
{"true_label": "netural", "pred_label": "positive", "text": "nice app"}
{"true_label": "negative", "pred_label": "positive", "text": "Plhb Facebook I love is"}
{"true_label": "netural", "pred_label": "positive", "text": "It's pretty good so far. I'm still working on coordinating it with my other organisational apps."}
{"true_label": "negative", "pred_label": "positive", "text": "I love you app"}
{"true_label": "netural", "pred_label": "positive", "text": "Really nice"}
{"true_label": "negative", "pred_label": "netural", "text": "Missing everything good about gtasks and adds everything you hate about every other task list app."}
{"true_label": "negative", "pred_label": "netural", "text": "What has changed? All of a sudden im getting daily reminders to plan my day. Every day I disable this notification but the next day it pops up again. Not a huge inconvenience but very annoying!!!"}
{"true_label": "netural", "pred_label": "negative", "text": "When we add sub-task it gets added too slow!"}
{"true_label": "netural", "pred_label": "positive", "text": "Great app, but I have one issue. My tasks that I create on my phone doesn't sync with google tasks. How to fix it?"}
{"true_label": "positive", "pred_label": "netural", "text": "It's amazing ok I was really happy with the ability to create list and then a task and furthermore a subtask with a customizable reminder for each However the problem start there when you turn off the pop-up notification and only rely on the regular notification panel it just shows the the subtask name with no additional infos of the main task or the list not even the tag or the customized color is included with it I really sometimes find it difficult to identify the subtask hopefully you fix it"}
{"true_label": "negative", "pred_label": "netural", "text": "Ich habe diese App seit mehreren Jahren und finde sie eigentlich super, jedoch habe ich letzstens ein Update gemacht und dann wurden alle meine Bäume gelöscht, weil mañ nun das Premium Konto benötigt. Das kann ich garnicht verstehen. Ich würde gerne nur einen Stern geben, aber ansich finde ich die App gut und sie hilft mir auch mich zu konzentrieren, jedoch das mit den gelöschten Bäumen regt mich richtig auf."}
{"true_label": "positive", "pred_label": "netural", "text": "Why notifications are too short? I want to be able custmize my noti sounds!!!"}
{"true_label": "netural", "pred_label": "positive", "text": "We should be allowed save our data no matter who's a pro user. This dissatisfies me the most"}
{"true_label": "negative", "pred_label": "netural", "text": "Would agree that it isnt very user friendly. Functions seem complicated and too basic at the same time"}
{"true_label": "netural", "pred_label": "negative", "text": "Ребят, конечно круто что вы сделали это в виде игры. Только вот, вы бы могли доработать такие вещи: - сбивается сортировка задач после выхода из приложения. Я хочу чтобы у меня постоянно была сортировка по не выполненим ежедневным задачам. - я закрыла прогу на вкладке \"ежедневные задачи\" . Хочу чтобы при повторном открытии она была также на этой вкладке."}
{"true_label": "positive", "pred_label": "netural", "text": "It's good but the thing that annoys me is that if you set a daily repeating tasks it doesn't add itself automatically to the \"My day\" list. I downloaded this thinking i could program my week with it and would know everything i have to do or if i missed something just by looking at the widget but having to add tasks manually kinda defeates the point, also i wanted this app specifically cause i thought i could sync it with my pc but i haven't tried that get cause its not like automated"}
{"true_label": "positive", "pred_label": "netural", "text": "I wish I could pick the day tasks to display on the widget. Since the last update I can only see whole lists, not those I prioritized. Edit: thanks for the response, but this is not true. When I change the layout in the app and delete and reload the widget, it still lists personal first"}
{"true_label": "netural", "pred_label": "positive", "text": "I really can't speak to the full experience, because I do not have the premium version, but so far the free version has helped me with keeping my projects and tasks in one place. I am still getting the hang of prioritizing, but that is more of a personal thing."}
{"true_label": "negative", "pred_label": "netural", "text": "Main issues to solve: 1) in the icon app there isn't the indication of current day. Would be very useful to have it instead of the standard BC violet icon 2) there isn't the possibility to set two different time zone in the fields \"from\" and \"to\" in the same event. It would be very useful to set fights event with different time zone. 3)the location link should be synchronised with Google maps results, not with the contacts, in order to have the right response for the addresses. Please update"}
{"true_label": "negative", "pred_label": "positive", "text": "The best app for focus life"}
{"true_label": "netural", "pred_label": "positive", "text": "Nice"}
{"true_label": "negative", "pred_label": "netural", "text": "Seems a bit pointless that you cant set any goals..."}
{"true_label": "netural", "pred_label": "negative", "text": "Planner isnt saving all day events.  You can see an event is there in month view but when you open that day the event does not show."}
{"true_label": "positive", "pred_label": "netural", "text": "Good"}
{"true_label": "netural", "pred_label": "negative", "text": "App crashes whenever I try to edit time of any task."}
{"true_label": "positive", "pred_label": "negative", "text": "Too overloaded main screen"}
{"true_label": "negative", "pred_label": "netural", "text": "I m just very lazy enough to use this app plus this app is not based on concept of habit building.Let's see how habbit is built u do task u get reward but here for sake of reward u only get Dots connected in pattern that's not motivating instead u can give some offers as reward."}
{"true_label": "positive", "pred_label": "netural", "text": "What I miss: Option to edit singular block from a routine (e.g. clear or move a routine block if an event for a given day overlaps without pausing the routine) Otherwise great. An implementation of the mentioned feature is a surefire way to make me buy pro."}
{"true_label": "negative", "pred_label": "netural", "text": "Always missing the notifications even when it is not optimized and restricted in background."}
{"true_label": "positive", "pred_label": "netural", "text": "Locking option is not available..All other features are excellent."}
{"true_label": "positive", "pred_label": "netural", "text": "I'm trying to use this a family organiser and so far so good. The only feature I'd really like is to share reminders - is that possible? E.g. if I set a task in a shared list, I'd like everyone to receive a reminder for that task (or at least the person who has been assigned). As it stands, you can only set up reminders for yourself."}
{"true_label": "netural", "pred_label": "negative", "text": "App allow list missing important options. For instance can't whitelist calculator, calendar, chrome."}
{"true_label": "positive", "pred_label": "negative", "text": "Good 👍"}
{"true_label": "netural", "pred_label": "positive", "text": "Great app and so far no issues using it"}
{"true_label": "netural", "pred_label": "negative", "text": "Unnecessarily complex. A simple one dimensional version would be fine"}
{"true_label": "positive", "pred_label": "netural", "text": "Great App, but wrong week numbers for 2021"}
{"true_label": "negative", "pred_label": "positive", "text": "I can't believe you guys locked all the good trees with premium. Students who are saving money can't spend it on apps. Purchasing new trees always gave me motivation boost.👎"}
{"true_label": "netural", "pred_label": "positive", "text": "I feel that there should be an option to keep track of a habit which we repeat multiple times in a day. Update: Thanks your quick response. I don't see a multiple repeat for the same day. If I want to track a habit 3 times a day, there is no option for that. There is an option only to repeat multiple times a week but not mutiple times a day."}
{"true_label": "netural", "pred_label": "positive", "text": "Please use the app the widget, and see for yourself if ur comfortable with it. Compare it with s planner."}
{"true_label": "netural", "pred_label": "positive", "text": "I really love this app. It helps me so much to focus on my work, and seeing how my forest looks after some hours of deep focus is really motivating, despite that, I unfortunately have been having some issues with the app. I use the whitelist and I've noticed that when I'm planting my tree, I can access not only the whitelisted apps but all of the apps in my device. This is a real bummer and a hope you guys fix that, please! Nevertheless is an awesome app and I cannot recommend it enough!"}
{"true_label": "negative", "pred_label": "netural", "text": "no repeat alarm"}
{"true_label": "netural", "pred_label": "negative", "text": "The app's really nice and I really like it but it's just REALLY REALLY BUGGY for my phone. I can't switch between the calendar and tasks with ease. I can't even slash out items on the to do list smoothly. It could've been such a big game changer for how I do things!! :-("}
{"true_label": "positive", "pred_label": "netural", "text": "A really amazing note and habit tracker app. Unfortunately there's a lot of cool resources that are paid :("}
{"true_label": "netural", "pred_label": "negative", "text": "the app itself is a wonderful idea, but the interface and functions need a lot of work in my opinion. it took me so long to figure out how to set up a habit, and i still don't understand how to use a task groups or steps. I gave up and came back to my previous tracker because it was too complicated and time consuming to learn how to use this one. Anyway, I will definitely retry after an update :)"}
{"true_label": "negative", "pred_label": "netural", "text": ",infoo"}
{"true_label": "positive", "pred_label": "netural", "text": "Decent app with good features allowing for good habbit tracking but I am unable to reschedule dates on the habits. I have to delete the habit then remake it with the revised dates which is a big hassle"}
{"true_label": "netural", "pred_label": "negative", "text": "Event notifications don't sound."}
{"true_label": "netural", "pred_label": "positive", "text": "From an old Wunderkist fan: Design and migration is nice thank you. Please bring back weekly to do widget or at least make possible to select only \"earlier\" tasks to show up in widget. Additionally, in widget if due date is passed please show the task in red color. I don't want to see may tax payments next year in the widget. Please bring weekly list to the widget. Thank you."}
{"true_label": "negative", "pred_label": "netural", "text": "complicated"}
{"true_label": "positive", "pred_label": "netural", "text": "Neat Widget"}
{"true_label": "negative", "pred_label": "netural", "text": "It's constantly annoying me with notifications that I always have to turn off."}
{"true_label": "netural", "pred_label": "negative", "text": "Everything is okay but it doesn't notify on time. I missed an important event because of this bug. I've used other apps on Play Store and all of them have the same problem. Some of them don't notify when the screen is locked. None of them are perfect. At times the app notifies me only after I open it."}
{"true_label": "positive", "pred_label": "negative", "text": "Brilliant app"}
{"true_label": "netural", "pred_label": "negative", "text": "I pay for the premium app and it keeps closing down on me once Im in the app. What can I do to keep that from happening?"}
{"true_label": "positive", "pred_label": "negative", "text": "#gottapracticeit"}
{"true_label": "negative", "pred_label": "netural", "text": "I buy the platinum app, but the reminders doesn't work!!! Please fix it! . It's a great app but the reminders are very important to me."}
{"true_label": "negative", "pred_label": "netural", "text": "I've enjoyed the app for a few years, but it has gotten increasingly buggy for me--the widget works intermittently, and all of a sudden one of my habits stopped tracking a streak today, which persisted even after uninstalling and reinstalling."}
{"true_label": "positive", "pred_label": "netural", "text": "It would be 5 stars, but I regularly have issues getting the widget to work. Any suggestions?"}
{"true_label": "negative", "pred_label": "netural", "text": "It doesn't remind me. I even forgot I still had it on my phone."}
{"true_label": "negative", "pred_label": "netural", "text": "Everything great. But you guys have made basic reminder a premium feature, very disappointed 😞"}
{"true_label": "netural", "pred_label": "positive", "text": "I like it true"}
{"true_label": "netural", "pred_label": "positive", "text": "An excellent app. What I like most is statistics. What I dislike most: Sometimes, the timer won't ring even after the time is over (This happens Only when the screen is off or the phone is locked)"}
{"true_label": "netural", "pred_label": "negative", "text": "I purchased the pro version, there was an update and now the pro version is gone. I cannot seam to get it back and I have written thru the feedback link with no response. The pro version purchase shows in my play folder but I cannot get the pro version loaded. I uninstalled and reinstalled and still no help. Need to get the pro version loaded again, please help."}
{"true_label": "netural", "pred_label": "positive", "text": "So far I love the layout and look... I'm not giving it 5 yet but will update as I use it more... I don't like that if I click on my notification that it opens the event to save or delete I stead of just looking at it or giving me the option to complete. My other issue is not being able to change the time I want an all day reminder. Again I love it so far but would like to see that changed."}
{"true_label": "negative", "pred_label": "netural", "text": "Love it and it's good start to build on! But there appears to be syncing issues between calendars no matter how many times I refresh. I'm going to give it time before I give up on it. I'm big on my Happy Planner and would totally ditch it for this if it had similar features, such as a budget planner one could add. I wouldn't use most of the stickers, which is unfortunate because I love my stickers in my planners. Overall....good start?"}
{"true_label": "netural", "pred_label": "negative", "text": "I am hating the experience now, this app was so great untill it started missing on my tasks reminders and its crazy i couldn't get a very important task done that i put a reminder to here, and i have allowed tick tick all the functions it needs but this reminder thing, its pissing me off, please get it fixed."}
{"true_label": "positive", "pred_label": "netural", "text": "Best app to stay focused."}
{"true_label": "netural", "pred_label": "positive", "text": "I feel that there should be an option to keep track of a habit which we repeat multiple times in a day. Update: Thanks your quick response. I don't see a multiple repeat for the same day. If I want to track a habit 3 times a day, there is no option for that. There is an option only to repeat multiple times a week but not mutiple times a day."}
{"true_label": "negative", "pred_label": "netural", "text": "Ok it was good app but all the good feature are in premium no use of downloading if I'm not satisfied why would i pay for a premium one"}
{"true_label": "negative", "pred_label": "netural", "text": "4k 7g8 0 3rd v of. Uhuh"}
{"true_label": "negative", "pred_label": "positive", "text": "I like how the app has options to write notes/journals for each day. It gives you the option to reflect on how you stuck to your habits. Most other apps don't have this feature. That said, I'm rating the app two stars because the notifications don't work for me. I have set times for reminders throughout the day, but the app sends me random notifications (reminders) when I don't want them. And on other days, no notifications at all. No app updates from the developer in over a year either."}
{"true_label": "negative", "pred_label": "netural", "text": "Was great, had collected loads of very pretty trees. However, the new update took them all away. Hate this update, will not be paying for pro as cannot afford too, and would like all of my nice trees back"}
{"true_label": "netural", "pred_label": "negative", "text": "I have been using this app for years, and have loved it, but the latest version is sucking my battery. It's very frustrating."}
{"true_label": "positive", "pred_label": "netural", "text": "I like that this app includes major religious and national holidays like Christmas and Thanksgiving. Google and samsung calendars don't include them by default."}
{"true_label": "netural", "pred_label": "negative", "text": "The Reminder option is not working....I have paid for premium to use the app to its full potential but Unfortunately....The basic feature of the app to remind you to stick to your schedule with respect to habits you creat dosent work....kindly help by resolving this issue... Color code Options are limited that can be assigmed to the newly added habit"}
{"true_label": "positive", "pred_label": "netural", "text": "The app is great, but I am homeschooling, and I need the whitelist. I am ok with paying for different trees, but not having the app whitelist, for me at least, makes this app not very useful. I use my device all the time for work, and this makes this app hard to use. This is still a great app, just not very convenient."}
{"true_label": "positive", "pred_label": "netural", "text": "Great app, not fully compatible with GTD (no context and task status only available by kanban), also widget is broken on 1+ Nord (stops refreshing after it is created) still first impressions are great. Unfortunately app had performance issues, after running for a while in the background, returning to app results in extremely slow text input, so slow it even looses chars. Only shutting down the app and starting again solves the problem."}
{"true_label": "netural", "pred_label": "negative", "text": "Not for me."}
{"true_label": "netural", "pred_label": "negative", "text": "The Reminder option is not working....I have paid for premium to use the app to its full potential but Unfortunately....The basic feature of the app to remind you to stick to your schedule with respect to habits you creat dosent work....kindly help by resolving this issue... Color code Options are limited that can be assigmed to the newly added habit"}
{"true_label": "positive", "pred_label": "negative", "text": "good"}
{"true_label": "netural", "pred_label": "negative", "text": "I really liked the look of this app, and was very nearly a Todoist convert because of the planning features, but the lack of integration with google assistant and other things in my workflow was a deal-breaker. Will check it out again when integrations are better."}
{"true_label": "positive", "pred_label": "netural", "text": "What I miss: Option to edit singular block from a routine (e.g. clear or move a routine block if an event for a given day overlaps without pausing the routine) Otherwise great. An implementation of the mentioned feature is a surefire way to make me buy pro."}
{"true_label": "netural", "pred_label": "positive", "text": "Just add 'To Do List' feature. Highly recommend."}
{"true_label": "netural", "pred_label": "negative", "text": "The app itself is really great. However, if you are going to buy premium, please make an account first, then buy premium. I bought premium without an account and was fine until I switched phones. I couldn't buy premium again because the option had disappeared but I didn't have access to premium features. I had even emailed support about the issue and gave the invoice number from Google play store. No response. This is enough to make me not use the app again."}
{"true_label": "netural", "pred_label": "negative", "text": "Good not bad"}
{"true_label": "netural", "pred_label": "negative", "text": "Planner isnt saving all day events.  You can see an event is there in month view but when you open that day the event does not show."}
{"true_label": "positive", "pred_label": "netural", "text": "Good App But a big PROBLEM please add an option to save all plans as a text document and import and export it for example today i planned to install any.do two months later i see that what i done two months ago Tnx🌹🙏🏻"}
{"true_label": "negative", "pred_label": "netural", "text": "i hate how you cannot open the app and see all your lists there. you have to have one open at all times and it does not show a list of your list on the home screen. deleting this app for this reason. too bad... the rest is great. but they need a home screen. they don't have one."}
{"true_label": "negative", "pred_label": "netural", "text": "It's ok. The free version does the same thing your calender does on  your phone."}
{"true_label": "negative", "pred_label": "positive", "text": "Great app that suffers from the most annoying design flaw. Every time I create a task, it goes to the bottom of the list. I always want the task at the top so I can see it. That's the whole point of using a to do list. So I have to drag the task, one by one to the top. Makes me crazy."}
{"true_label": "negative", "pred_label": "positive", "text": "Nice"}
{"true_label": "netural", "pred_label": "negative", "text": "I really liked this app and had bought quite a few of the more expensive trees, which they let us keep after they decided those would be part of the pro version. But now we can't even have those? Sure you refunded us but you're not creating any interesting new trees for the free version so why bother? Disappointed."}
{"true_label": "positive", "pred_label": "netural", "text": "The app looks really nice. Unfortunately I don't have the motivation to work on myself rn but I'll come back to it later..."}
{"true_label": "netural", "pred_label": "positive", "text": "Nice and easy way to keep track of your streaks and habits. Also pretty cool that there are comment boards so you can interact with people doing the same things. Nice to get encouragement and share tips. Really cool app overall."}
{"true_label": "positive", "pred_label": "netural", "text": "great so far, it would be nice to allow the 5 buttons on the widget have an option to skip a day, week or month forward or backward, if i would like to look ahead i have to open one or two apps when it could be a button you set on the widget. maybe even a button option that allows one widget to switch between multiple calendars, just thought id include that suggestion."}
{"true_label": "positive", "pred_label": "netural", "text": "App is great, but I think there should be an option where you cannot exit from your timer. To maintain your focus more."}
{"true_label": "netural", "pred_label": "negative", "text": "Same review as rpg gamify"}
{"true_label": "netural", "pred_label": "negative", "text": "Used to work really well, now the notifications wont work on my xiaomi phone, rendering ot pretty much useless..and I tried everything"}
{"true_label": "positive", "pred_label": "netural", "text": "This is the best time blocking app I've found, but it still has some significant pain points. I wish there was a desktop version, since creating/updating blocks would be 5x faster with a keyboard, mouse, and large screen. Editing would be faster too if blocks could temporarily overlap, and if routines were per day instead of per week."}
{"true_label": "negative", "pred_label": "netural", "text": "Great app but with a poor 12hr sync to Google Calendar (with no response from the developer in over a year, after an immediate response). If they cant see this is a problem, that is a problem."}
{"true_label": "netural", "pred_label": "positive", "text": "Plz plz plz plz make it offline guys!"}
{"true_label": "netural", "pred_label": "negative", "text": "Doesn't meet my needs. I'm looking for a to-do app that allows me to see the tasks on my smart watch, click them done, then restore the tasks. Wanting to create a task list that I'll do repeatedly. I do not want to have to touch my phone. This app doesn't perform in a manner that supports that."}
{"true_label": "positive", "pred_label": "negative", "text": "Seems to have stopped sending reminder notifications, which makes the app kinda pointless for me. Edit 19/12/2020: issue seems to have resolved itself in subsequent updates."}
